In [1]:
import pandas as pd

import requests
from bs4 import BeautifulSoup

In [206]:
url = "https://www.the-numbers.com/movie/budgets/all/1401"
res = requests.get(url)

In [207]:
print(res.raise_for_status())
soup = BeautifulSoup(res.text)
type(soup)

None

bs4.BeautifulSoup

In [208]:
movies = soup.findAll('tr')

In [209]:
movies[1].findAll('td')[1].string

'Jan 25, 2002'

In [210]:
len(movies)

101

In [211]:
dates = []
names = []
budget = []

for i in list(range(1, 101)):
    dates.append((movies[i].findAll('td')[1].string))
    names.append((movies[i].findAll('td')[2].string))
    budget.append((movies[i].findAll('td')[3].string))
    
# dates    
# names
# budget

df = pd.DataFrame(list(zip(dates, names,budget)), 
               columns =['Date', 'Name','Budget']) 
df

            Date                                 Name        Budget
0   Jan 25, 2002               The Mothman Prophecies   $42,000,000
1   Jul 14, 1989                      Licence to Kill   $42,000,000
2   Dec 20, 2018                      Holmes & Watson   $42,000,000
3   Jan 27, 2012                    One for the Money   $42,000,000
4    Mar 9, 2001                           15 Minutes   $42,000,000
..           ...                                  ...           ...
95  Aug 12, 2011                  Final Destination 5   $40,000,000
96   Nov 9, 2018                               Widows   $40,000,000
97   Apr 8, 2005                          Fever Pitch   $40,000,000
98  Dec 25, 2007        Aliens vs. Predator - Requiem   $40,000,000
99  Dec 25, 2007  The Water Horse: Legend of the Deep   $40,000,000

[100 rows x 3 columns]

In [212]:

df.to_csv('budget_page15.csv')

In [213]:
df1 = pd.read_csv('budget_page1.csv')

In [215]:
df2 = pd.read_csv('budget_page2.csv')

In [216]:
df3 = pd.read_csv('budget_page3.csv')

In [217]:
df4 = pd.read_csv('budget_page4.csv')

In [218]:
df5 = pd.read_csv('budget_page5.csv')

In [219]:
df6 = pd.read_csv('budget_page6.csv')

In [220]:
df7 = pd.read_csv('budget_page7.csv')

In [221]:
df8 = pd.read_csv('budget_page8.csv')

In [222]:
df9 = pd.read_csv('budget_page9.csv')

In [223]:
df10 = pd.read_csv('budget_page10.csv')

In [224]:
df11 = pd.read_csv('budget_page11.csv')

In [225]:
df12 = pd.read_csv('budget_page12.csv')

In [226]:
df13 = pd.read_csv('budget_page13.csv')

In [227]:
df14 = pd.read_csv('budget_page14.csv')

In [228]:
df15= pd.read_csv('budget_page15.csv')

In [229]:
to_concat = [df1, df2, df3, df4, df5, df6, df7, df8, df9, df10, df11, df12, df13, df14, df15]
combined_df = pd.concat(to_concat)

In [233]:
combined_df.tail()

,Unnamed: 0,Date,Name,Budget
95,95,"Aug 12, 2011",Final Destination 5,"$40,000,000"
96,96,"Nov 9, 2018",Widows,"$40,000,000"
97,97,"Apr 8, 2005",Fever Pitch,"$40,000,000"
98,98,"Dec 25, 2007",Aliens vs. Predator - Requiem,"$40,000,000"
99,99,"Dec 25, 2007",The Water Horse: Legend of the Deep,"$40,000,000"

In [234]:
combined_df.reset_index()

,index,Unnamed: 0,Date,Name,Budget
0,0,0,"Apr 23, 2019",Avengers: Endgame,"$400,000,000"
1,1,1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$379,000,000"
2,2,2,"Apr 22, 2015",Avengers: Age of Ultron,"$365,000,000"
3,3,3,"Dec 16, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000"
4,4,4,"Apr 25, 2018",Avengers: Infinity War,"$300,000,000"
...,...,...,...,...,...
1495,95,95,"Aug 12, 2011",Final Destination 5,"$40,000,000"
1496,96,96,"Nov 9, 2018",Widows,"$40,000,000"
1497,97,97,"Apr 8, 2005",Fever Pitch,"$40,000,000"
1498,98,98,"Dec 25, 2007",Aliens vs. Predator - Requiem,"$40,000,000"
1499,99,99,"Dec 25, 2007",The Water Horse: Legend of the Deep,"$40,000,000"

In [235]:
combined_df.to_csv('allmovies_budget.csv')